# Post-processing
<p> Purpose:  Inspect data.  Post-processing required since data is processed by year 
    and final aggergations needs to 
    be peformed based on the whole data set.</p>

## Import Dependencies

In [1]:
#!usr/bin/env python3
import os
import shutil
import pandas as pd
import numpy as np
import dateutil #https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/
from datetime import datetime
import glob
import time
from io import StringIO
from pathlib import Path

# Hide warning messages in notebook
import warnings
warnings.filterwarnings('ignore')

In [2]:
pd.set_option("max_rows", 100) #100

In [3]:
cur_dir = os.getcwd()

In [4]:
cleansed_dir = os.path.join(cur_dir,'citibike_files','cleansed')

In [5]:
path = cleansed_dir

all_files = sorted(glob.glob(os.path.join(path, "*citibike*")))

all_df = []

#parse_dates=['starttime','stoptime'],

for f in all_files:
    try: 
        file_name = f.split('/')[-1] 
        df = pd.read_csv(f, sep=',',header = 1,skiprows = 1)
        row_count = (len(df.index))
        base, ext = os.path.splitext(file_name)
        base = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed', file_name))
        #print(f"{base}_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','{file_name}'))")
        print(f"{file_name}   [rowcount: {row_count}]")
    except:
         print('except:' + f)

citibike_bikes.csv   [rowcount: 21819]
citibike_customers.csv   [rowcount: 39646]
citibike_distinct_stations.csv   [rowcount: 1214]
citibike_distinct_stations_final.csv   [rowcount: 531]
citibike_start_stations.csv   [rowcount: 322437]
citibike_trips_daily.csv   [rowcount: 942]
citibike_trips_hourly.csv   [rowcount: 22640]

In [6]:
cur_dir = os.getcwd()

## Bikes

In [7]:
citibike_bikes_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_bikes.csv'))
citibike_bikes_df.set_index('bikeid',inplace=True)
citibike_bikes_df.sort_index(axis = 0) 
citibike_bikes_df

               min         max  count      sum
bikeid
14529   2013-06-05  2013-12-31    885   825072
14531   2013-06-01  2013-12-31   1125  1031192
14532   2013-06-02  2013-12-28   1224  1139052
14533   2013-06-06  2013-12-27   1035  1030752
14534   2013-06-01  2013-12-28   1052  1038703
...            ...         ...    ...      ...
24763   2015-12-30  2015-12-30      1      658
24765   2015-11-29  2015-12-31    226   171036
24766   2015-12-11  2015-12-11      3     1735
24768   2015-12-15  2015-12-31    115    78023
24769   2015-12-15  2015-12-31     56    41628

[21821 rows x 4 columns]

## Customers

In [8]:
citibike_customer_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_customers.csv'))
citibike_customer_df.set_index('startdate',inplace=True)
citibike_customer_df.sort_index(axis = 0) 
citibike_customer_df

            gender  age bracket    usertype  count
startdate
2013-06-01       0      (-1, 1]    Customer   3447
2013-06-01       0      (-1, 1]  Subscriber      0
2013-06-01       0      (1, 18]    Customer      0
2013-06-01       0      (1, 18]  Subscriber      0
2013-06-01       0     (18, 25]    Customer      0
...            ...          ...         ...    ...
2015-12-31       2     (45, 65]  Subscriber   1313
2015-12-31       2    (65, 100]    Customer      0
2015-12-31       2    (65, 100]  Subscriber    185
2015-12-31       2  (100, 1000]    Customer      0
2015-12-31       2  (100, 1000]  Subscriber      0

[39648 rows x 4 columns]

## Stations

In [9]:
citibike_distinct_station_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_distinct_stations.csv'))
citibike_distinct_station_df.set_index('station id',inplace=True)
citibike_distinct_station_df.sort_index(axis = 0) 
citibike_distinct_station_df

            station latitude  station longitude                station name
station id
406                   40.695            -73.996      Hicks St & Montague St
475                   40.735            -73.988         E 15 St & Irving Pl
2008                  40.706            -74.017       Little West St & 1 Pl
485                   40.750            -73.983             W 37 St & 5 Ave
285                   40.735            -73.991          Broadway & E 14 St
...                      ...                ...                         ...
3138                  40.774            -73.962          E 77 St & Park Ave
3153                  40.768            -73.959             E 71 St & 2 Ave
3238                  40.774            -73.954             E 80 St & 2 Ave
3241                  40.686            -73.945    Monroe St & Tompkins Ave
3242                  40.691            -73.992  Schermerhorn St & Court St

[1216 rows x 3 columns]

In [10]:
citibike_distinct_station_final_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_distinct_stations_final.csv'))
citibike_distinct_station_final_df
citibike_distinct_station_final_df.sort_values("station id", axis = 0, ascending = True, inplace = True, na_position ='first')

In [11]:
citibike_distinct_station_final_df.set_index('station id',inplace=True)
citibike_distinct_station_final_df.sort_index(axis = 0) 
citibike_distinct_station_final_df

            station latitude  station longitude                   station name
station id
72                    40.767            -73.994               W 52 St & 11 Ave
79                    40.719            -74.007       Franklin St & W Broadway
82                    40.711            -74.000         St James Pl & Pearl St
83                    40.684            -73.976  Atlantic Ave & Fort Greene Pl
116                   40.742            -74.001                W 17 St & 8 Ave
...                      ...                ...                            ...
3236                  40.759            -73.994                     PABT Valet
3237                  40.754            -73.943                 21 St & 41 Ave
3238                  40.774            -73.954                E 80 St & 2 Ave
3241                  40.686            -73.945       Monroe St & Tompkins Ave
3242                  40.691            -73.992     Schermerhorn St & Court St

[533 rows x 3 columns]

In [12]:
# # Post-Processing:  Data is processed by year.  Final aggregation needed to produce distinct stations for all years.
# citibike_distinct_station_final_df = pd.read_csv(os.path.join(cur_dir, 'citibike_files', 'cleansed', 'citibike_distinct_stations.csv'))
# citibike_distinct_station_final_df = pd.DataFrame(citibike_distinct_station_final_df)
# citibike_distinct_station_final_df = citibike_distinct_station_final_df.drop_duplicates(subset=["station id", "station latitude","station longitude","station name"],keep='first')
# citibike_distinct_station_final_df = citibike_distinct_station_final_df[["station id", "station latitude","station longitude","station name"]]
# citibike_distinct_station_final_df.columns = ["station id", "station latitude","station longitude","station name"]
# citibike_distinct_station_final_df.set_index("station id", inplace=True)
# citibike_distinct_station_final_df.sort_values("station id", axis = 0, ascending = True, inplace = True, na_position ='first')
# citibike_distinct_station_final_df
# citibike_distinct_station_final_csv = os.path.join(cur_dir,'citibike_files','cleansed','citibike_distinct_stations_final.csv')
# if debug_mode == 'n':
#     if not os.path.isfile(citibike_distinct_station_final_csv):
#         citibike_distinct_station_final_df.to_csv(citibike_distinct_station_final_csv, header='column_names', index=False)
#     else: # else it exists so append without writing the header
#         citibike_distinct_station_final_df.to_csv(citibike_distinct_station_final_csv, mode='a', header=False, index=False)

In [13]:
citibike_start_stations_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_start_stations.csv'))
citibike_start_stations_df.set_index('start station id',inplace=True)
citibike_start_stations_df.sort_index(axis = 0) 
citibike_start_stations_df

                   startdate  count
start station id
72                2013-06-01     39
79                2013-06-01     57
82                2013-06-01      6
83                2013-06-01     30
116               2013-06-01     51
...                      ...    ...
3236              2015-12-31     40
3237              2015-12-31     10
3238              2015-12-31     20
3241              2015-12-31      3
3242              2015-12-31     11

[322439 rows x 2 columns]

## Trips

In [14]:
citibike_trips_daily_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_trips_daily.csv'))
citibike_trips_daily_df.set_index('startdate',inplace=True)
citibike_trips_daily_df.sort_index(axis = 0) 
citibike_trips_daily_df

            count       sum
startdate
2013-06-01   8396  20949939
2013-06-02  15430  31983024
2013-06-03   7325  13696509
2013-06-04  15228  47275557
2013-06-05  15173  37382523
...           ...       ...
2015-12-27  13177  16701149
2015-12-28  18889  16794136
2015-12-29  13347   9699836
2015-12-30  22477  21472348
2015-12-31  20376  20558372

[944 rows x 2 columns]

In [15]:
citibike_trips_hourly_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_trips_hourly.csv'))
citibike_trips_hourly_df.set_index(['startdate'],inplace=True)
citibike_trips_hourly_df.sort_index(axis = 0) 
citibike_trips_hourly_df

           starthour  count     sum
startdate
2013-06-01        00    147  508309
2013-06-01        01    101  162181
2013-06-01        02     64  142713
2013-06-01        03     39  107823
2013-06-01        04     15   21727
...              ...    ...     ...
2015-12-31        19    670  650130
2015-12-31        20    516  458400
2015-12-31        21    458  594105
2015-12-31        22    367  516808
2015-12-31        23    254  299959

[22642 rows x 3 columns]